In [8]:
import pandas as pd

# Step 2: Load the CSV file
df = pd.read_csv('/Users/zahranazemian/Desktop/Python/state_us_updated1.csv')

# Step 3: Add the new column and set values
df['population of women'] = " "
df.loc[3, 'population of women'] = "1550400"

# Step 4: Save the modified DataFrame to a new CSV file
df.to_csv('/Users/zahranazemian/Desktop/Python/state_us_updated2.csv', index=False)
df.head(5)

        State Abbreviation  Population population of women
0     Alabama           AL   5,024,279
1      Alaska           AK     733,391
2     Arizona           AZ   7,151,502
3    Arkansas           AR   3,011,524             1550400
4  California           CA  39,538,223

In [12]:
import numpy as np

# replace "?" to NaN
df.replace(" ", np.nan, inplace = True)
df.head(5)

        State Abbreviation  Population population of women
0     Alabama           AL   5,024,279                 NaN
1      Alaska           AK     733,391                 NaN
2     Arizona           AZ   7,151,502                 NaN
3    Arkansas           AR   3,011,524             1550400
4  California           CA  39,538,223                 NaN

In [13]:
missing_data = df.isnull()
missing_data.head(5)

   State  Abbreviation  Population  population of women
0  False         False       False                 True
1  False         False       False                 True
2  False         False       False                 True
3  False         False       False                False
4  False         False       False                 True

In [14]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

State
State
False    51
Name: count, dtype: int64

Abbreviation
Abbreviation
False    51
Name: count, dtype: int64

Population
Population
False    51
Name: count, dtype: int64

population of women
population of women
True     50
False     1
Name: count, dtype: int64

In [18]:
california_population = df.loc[df['State'] == 'California', 'Population'].values[0]

print(california_population)

39,538,223

In [19]:
california_row_index = df.index[df['State'] == 'California'].tolist()

print(california_row_index)

[4]

In [32]:
c_1 = int(california_population.replace(',', ''))
c_2 = (c_1 - 1)/2
df.loc[4, 'population of women'] = c_2
df.head(5)

        State Abbreviation  Population population of women
0     Alabama           AL   5,024,279                 NaN
1      Alaska           AK     733,391                 NaN
2     Arizona           AZ   7,151,502                 NaN
3    Arkansas           AR   3,011,524             1550400
4  California           CA  39,538,223          19769111.0

In [33]:
avg_norm_loss = df["population of women"].astype("float").mean(axis=0)
print("Average of population of women:", avg_norm_loss)

Average of population of women: 10659755.5

In [35]:
df["population of women"].replace(np.nan, avg_norm_loss, inplace=True)
df.head(5)

/var/folders/lr/7qjwyg613b1413bcv2hxrqqc0000gn/T/ipykernel_49215/3719103001.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["population of women"].replace(np.nan, avg_norm_loss, inplace=True)

        State Abbreviation  Population population of women
0     Alabama           AL   5,024,279          10659755.5
1      Alaska           AK     733,391          10659755.5
2     Arizona           AZ   7,151,502          10659755.5
3    Arkansas           AR   3,011,524             1550400
4  California           CA  39,538,223          19769111.0